In [13]:
import pandas as pd
import numpy as np 
from io import StringIO,BytesIO
import random

In [14]:
data = pd.read_excel(r'C:\Filtering_data.xlsx', sheet_name=0)
data

    ID       Name  Age     City  Salary
0    1       Aman   25    Delhi   50000
1    2       Riya   22   Mumbai   60000
2    3      Vikas   30    Delhi   55000
3    4       Neha   28  Chennai   58000
4    5      Ankit   26   Mumbai   52000
5    6      Pooja   24    Delhi   57000
6    7      Rahul   29     Pune   53000
7    8     Simran   27   Mumbai   56000
8    9      Tanya   23    Delhi   54000
9   10  Siddharth   31  Chennai   59000
10  11      Rohit   32     Pune   60000
11  12      Sonia   21    Delhi   51000
12  13     Aakash   26   Mumbai   58000
13  14      Priya   25     Pune   54000
14  15      Karan   29  Chennai   57000
15  16      Megha   28    Delhi   59000
16  17     Deepak   24   Mumbai   52000
17  18       Isha   22     Pune   53000
18  19     Nikhil   30  Chennai   56000
19  20       Alka   27    Delhi   55000

In [15]:
data2 = pd.read_excel(r'C:\Filtering_data.xlsx', sheet_name=1)

In [16]:
data2

,employee_id,first_name,last_name,email,department,salary,joining_date,age,bonus,Hand_on_salary,deduction,final_pay
0,1,Joshua,Ramos,alexandra29@gmail.com,Operations,65313.80,2024-05-23,42,71845.180,137158.980,1959.4140,63354.3860
1,2,Christina,Clark,littlekyle@yahoo.com,IT,58827.32,2021-10-02,46,64710.052,123537.372,1764.8196,57062.5004
2,3,Jonathon,Sullivan,tannerivan@johnson.com,Operations,57427.31,2020-04-30,50,63170.041,120597.351,1722.8193,55704.4907
3,4,Clinton,Aguirre,jamieortega@yahoo.com,HR,45352.74,2021-04-04,55,49888.014,95240.754,1360.5822,43992.1578
4,5,Veronica,Weber,trevinosteven@ramos.com,Operations,78772.56,2020-10-06,51,86649.816,165422.376,2363.1768,76409.3832
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Brandi,Cowan,qsimmons@gmail.com,Finance,97102.57,2024-11-07,41,106812.827,203915.397,2913.0771,94189.4929
996,997,Michael,Gray,curtisruben@gmail.com,IT,40509.73,2023-03-11,37,44560.703,85070.433,1215.2919,39294.4381
997,998,Cassandra,Rodriguez,brittneytran@dunlap.info,Finance,72886.03,2024-07-25,32,80174.633,153060.663,2186.5809,70699.4491
998,999,April,Howard,crystalcohen@smith.com,Operations,32177.63,2022-04-06,29,35395.393,67573.023,965.3289,31212.3011
999,1000,Benjamin,Palmer,darylsnyder@williams.com,IT,87670.82,2020-04-03,38,96437.902,184108.722,2630.1246,85040.6954

In [17]:
data['Name']

0          Aman
1          Riya
2         Vikas
3          Neha
4         Ankit
5         Pooja
6         Rahul
7        Simran
8         Tanya
9     Siddharth
10        Rohit
11        Sonia
12       Aakash
13        Priya
14        Karan
15        Megha
16       Deepak
17         Isha
18       Nikhil
19         Alka
Name: Name, dtype: object

In [31]:
names = ["Aayush",'Aman',"disha",'Jeevni','Akshay','Sapna','Sonam','Vaishnavi','Muskan','Surendra','Veer','krishna','Rajendra','Rohit','Rahul','Oshi','Deeksha','Pushpenddra','jeevan','Ramprasad']
cities = ['Srinagar','Shimla','chandigarh','Lucknow','Leh','Bhopal','Patna','Raipur','Mumbai','Banglore','Gandhinagar','Chennai','Thiruvananthpuram','Bhubneshwar','Vishakhapatnam','Surat','Aizawl','Dispur','Itanagar','Shillog','Agartala','Imphal']
meta = []
for i in range(1,101):
    name = random.choice(names + [None])
    age = random.choice([random.randint(18,32),None])
    marks = random.choice([random.randint(40,100),None])
    city = random.choice(cities+["",None])
    meta.append([i,name,age,marks,city])
meta = pd.DataFrame(meta,columns = ['ID',"Name","Age","Marks","City"])
meta

     ID         Name   Age  Marks            City
0     1       Muskan  19.0    NaN  Vishakhapatnam
1     2         Aman   NaN    NaN     Bhubneshwar
2     3        disha  32.0    NaN         Chennai
3     4      Deeksha  18.0   56.0
4     5  Pushpenddra  19.0    NaN        Agartala
..  ...          ...   ...    ...             ...
95   96      krishna   NaN    NaN  Vishakhapatnam
96   97    Ramprasad  20.0   43.0          Shimla
97   98        Rahul  28.0   68.0          Aizawl
98   99       Muskan  22.0    NaN          Bhopal
99  100    Vaishnavi  19.0   67.0        Srinagar

[100 rows x 5 columns]

In [29]:
# If the value is present then it shows "false" and if there doesn't have values then it will show "True"
data
print("isnull function is like that : \n ",data.isnull())

isnull function is like that :
         ID   Name    Age   City  Salary
0   False  False  False  False   False
1   False  False  False  False   False
2   False  False  False  False   False
3   False  False  False  False   False
4   False  False  False  False   False
5   False  False  False  False   False
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False
11  False  False  False  False   False
12  False  False  False  False   False
13  False  False  False  False   False
14  False  False  False  False   False
15  False  False  False  False   False
16  False  False  False  False   False
17  False  False  False  False   False
18  False  False  False  False   False
19  False  False  False  False   False

In [32]:
meta.isnull()

       ID   Name    Age  Marks   City
0   False  False  False   True  False
1   False  False   True   True  False
2   False  False  False   True  False
3   False  False  False  False  False
4   False  False  False   True  False
..    ...    ...    ...    ...    ...
95  False  False   True   True  False
96  False  False  False  False  False
97  False  False  False  False  False
98  False  False  False   True  False
99  False  False  False  False  False

[100 rows x 5 columns]

In [33]:
# notnull() : It shows that if the values is missing then it will show False and if there is value then it
# will show true..
data.notnull()

      ID  Name   Age  City  Salary
0   True  True  True  True    True
1   True  True  True  True    True
2   True  True  True  True    True
3   True  True  True  True    True
4   True  True  True  True    True
5   True  True  True  True    True
6   True  True  True  True    True
7   True  True  True  True    True
8   True  True  True  True    True
9   True  True  True  True    True
10  True  True  True  True    True
11  True  True  True  True    True
12  True  True  True  True    True
13  True  True  True  True    True
14  True  True  True  True    True
15  True  True  True  True    True
16  True  True  True  True    True
17  True  True  True  True    True
18  True  True  True  True    True
19  True  True  True  True    True

In [34]:
meta.notnull()

      ID  Name    Age  Marks  City
0   True  True   True  False  True
1   True  True  False  False  True
2   True  True   True  False  True
3   True  True   True   True  True
4   True  True   True  False  True
..   ...   ...    ...    ...   ...
95  True  True  False  False  True
96  True  True   True   True  True
97  True  True   True   True  True
98  True  True   True  False  True
99  True  True   True   True  True

[100 rows x 5 columns]

In [36]:
# isna() : The isna() function in Pandas is exactly the same as isnull() ,
# If the values is missing then True ..
# If the values is not missing then False ..
data.isna()

       ID   Name    Age   City  Salary
0   False  False  False  False   False
1   False  False  False  False   False
2   False  False  False  False   False
3   False  False  False  False   False
4   False  False  False  False   False
5   False  False  False  False   False
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False
11  False  False  False  False   False
12  False  False  False  False   False
13  False  False  False  False   False
14  False  False  False  False   False
15  False  False  False  False   False
16  False  False  False  False   False
17  False  False  False  False   False
18  False  False  False  False   False
19  False  False  False  False   False

In [37]:
meta.isna()

       ID   Name    Age  Marks   City
0   False  False  False   True  False
1   False  False   True   True  False
2   False  False  False   True  False
3   False  False  False  False  False
4   False  False  False   True  False
..    ...    ...    ...    ...    ...
95  False  False   True   True  False
96  False  False  False  False  False
97  False  False  False  False  False
98  False  False  False   True  False
99  False  False  False  False  False

[100 rows x 5 columns]

In [47]:
# fillna() : The fillna() function in Pandas is used to fill or replace missing values (NaN/None) in a DataFrame or Series with a specific value, method, or calculated value.
# It detects the missing values from our data ...
# value=number/Text : if we do then it will replace the None value with suggestive number/Text...
# inplace = true : Modify the original DataFrame or Series directly instead of returning a new one.
data.fillna(value=5,inplace = True)
meta.fillna(value=5)

     ID         Name   Age  Marks            City
0     1       Muskan  19.0    5.0  Vishakhapatnam
1     2         Aman   5.0    5.0     Bhubneshwar
2     3        disha  32.0    5.0         Chennai
3     4      Deeksha  18.0   56.0
4     5  Pushpenddra  19.0    5.0        Agartala
..  ...          ...   ...    ...             ...
95   96      krishna   5.0    5.0  Vishakhapatnam
96   97    Ramprasad  20.0   43.0          Shimla
97   98        Rahul  28.0   68.0          Aizawl
98   99       Muskan  22.0    5.0          Bhopal
99  100    Vaishnavi  19.0   67.0        Srinagar

[100 rows x 5 columns]

In [57]:
meta.fillna(value=4,inplace=False)

     ID         Name   Age  Marks            City
0     1       Muskan  19.0    4.0  Vishakhapatnam
1     2         Aman   4.0    4.0     Bhubneshwar
2     3        disha  32.0    4.0         Chennai
3     4      Deeksha  18.0   56.0
4     5  Pushpenddra  19.0    4.0        Agartala
..  ...          ...   ...    ...             ...
95   96      krishna   4.0    4.0  Vishakhapatnam
96   97    Ramprasad  20.0   43.0          Shimla
97   98        Rahul  28.0   68.0          Aizawl
98   99       Muskan  22.0    4.0          Bhopal
99  100    Vaishnavi  19.0   67.0        Srinagar

[100 rows x 5 columns]